7767517
2109 2616
SherpaMetaData           sherpa_meta_data1        0 0 0=2 1=32 2=4 3=7 15=1 -23316=5,2,4,3,2,4 -23317=5,384,384,384,384,384 -23318=5,192,192,192,192,192 -23319=5,1,2,4,8,2 -23320=5,31,31,31,31,31
Input                    in0                      0 1 in0
Input                    in1                      0 1 in1
Split                    splitncnn_0              1 2 in1 2 3
Input                    in2                      0 1 in2
Split                    splitncnn_1              1 4 in2 5 6 7 8
Input                    in3                      0 1 in3
Split                    splitncnn_2              1 3 in3 10 11 12
Input                    in4                      0 1 in4
Split                    splitncnn_3              1 2 in4 14 15
Input                    in5                      0 1 in5
Split                    splitncnn_4              1 4 in5 17 18 19 20
Input                    in6                      0 1 in6
Split                    splitncnn_5              1 2 in6 22 23
Input                    in7                      0 1 in7
Split                    splitncnn_6              1 4 in7 25 26 27 28
Input                    in8                      0 1 in8
Split                    splitncnn_7              1 3 in8 30 31 32
Input                    in9                      0 1 in9
Split                    splitncnn_8              1 2 in9 34 35
Input                    in10                     0 1 in10
Split                    splitncnn_9              1 4 in10 37 38 39 40
Input                    in11                     0 1 in11
Split                    splitncnn_10             1 2 in11 42 43
Input                    in12                     0 1 in12
Split                    splitncnn_11             1 4 in12 45 46 47 48
Input                    in13                     0 1 in13
Split                    splitncnn_12             1 3 in13 50 51 52
Input                    in14                     0 1 in14
Split                    splitncnn_13             1 2 in14 54 55
Input                    in15                     0 1 in15
Split                    splitncnn_14             1 4 in15 57 58 59 60
Input                    in16                     0 1 in16
Split                    splitncnn_15             1 2 in16 62 63
Input                    in17                     0 1 in17
Split                    splitncnn_16             1 4 in17 65 66 67 68
Input                    in18                     0 1 in18
Split                    splitncnn_17             1 3 in18 70 71 72
Input                    in19                     0 1 in19
Split                    splitncnn_18             1 2 in19 74 75
Input                    in20                     0 1 in20
Split                    splitncnn_19             1 4 in20 77 78 79 80
Input                    in21                     0 1 in21
Split                    splitncnn_20             1 2 in21 82 83
Input                    in22                     0 1 in22
Split                    splitncnn_21             1 4 in22 85 86 87 88
Input                    in23                     0 1 in23
Split                    splitncnn_22             1 3 in23 90 91 92
Input                    in24                     0 1 in24
Split                    splitncnn_23             1 2 in24 94 95
Input                    in25                     0 1 in25
Split                    splitncnn_24             1 4 in25 97 98 99 100
Input                    in26                     0 1 in26
Split                    splitncnn_25             1 2 in26 102 103
Input                    in27                     0 1 in27
Split                    splitncnn_26             1 4 in27 105 106 107 108
Input                    in28                     0 1 in28
Split                    splitncnn_27             1 3 in28 110 111 112
Input                    in29                     0 1 in29
Split                    splitncnn_28             1 2 in29 114 115
Input                    in30                     0 1 in30
Split                    splitncnn_29             1 4 in30 117 118 119 120
Input                    in31                     0 1 in31
Split                    splitncnn_30             1 2 in31 122 123
Input                    in32                     0 1 in32
Split                    splitncnn_31             1 4 in32 125 126 127 128
Input                    in33                     0 1 in33
Split                    splitncnn_32             1 3 in33 130 131 132
Input                    in34                     0 1 in34
Split                    splitncnn_33             1 2 in34 134 135
Input                    in35                     0 1 in35
Split                    splitncnn_34             1 4 in35 137 138 139 140
MemoryData               encoders.4.encoder.layers.3 0 1 141 0=1
MemoryData               encoders.4.encoder.layers.2 0 1 142 0=1
MemoryData               encoders.4.encoder.layers.1 0 1 143 0=1
MemoryData               encoders.4.encoder.layers.0 0 1 144 0=1
MemoryData               encoders.4.encoder.encoder_pos 0 1 145 0=384 1=47
MemoryData               encoders.4.encoder.encoder_pos_3 0 1 146 0=384 1=47
MemoryData               encoders.4.encoder.encoder_pos_2 0 1 147 0=384 1=47
MemoryData               encoders.4.encoder.encoder_pos_1 0 1 148 0=384 1=47
MemoryData               encoders.3.encoder.layers.1 0 1 149 0=1
MemoryData               encoders.3.encoder.layers.0 0 1 150 0=1
MemoryData               encoders.3.encoder.encoder_pos 0 1 151 0=384 1=11
MemoryData               encoders.3.encoder.encoder_pos_1 0 1 152 0=384 1=11
MemoryData               encoders.2.encoder.layers.2 0 1 153 0=1
MemoryData               encoders.2.encoder.layers.1 0 1 154 0=1
MemoryData               encoders.2.encoder.layers.0 0 1 155 0=1
MemoryData               encoders.2.encoder.encoder_pos 0 1 156 0=384 1=23
MemoryData               encoders.2.encoder.encoder_pos_2 0 1 157 0=384 1=23
MemoryData               encoders.2.encoder.encoder_pos_1 0 1 158 0=384 1=23
MemoryData               encoders.1.encoder.layers.3 0 1 159 0=1
MemoryData               encoders.1.encoder.layers.2 0 1 160 0=1
MemoryData               encoders.1.encoder.layers.1 0 1 161 0=1
MemoryData               encoders.1.encoder.layers.0 0 1 162 0=1
MemoryData               encoders.1.encoder.encoder_pos 0 1 163 0=384 1=47
MemoryData               encoders.1.encoder.encoder_pos_3 0 1 164 0=384 1=47
MemoryData               encoders.1.encoder.encoder_pos_2 0 1 165 0=384 1=47
MemoryData               encoders.1.encoder.encoder_pos_1 0 1 166 0=384 1=47
MemoryData               encoders.0.layers.1      0 1 167 0=1
MemoryData               encoders.0.layers.0      0 1 168 0=1
MemoryData               encoders.0.encoder_pos   0 1 169 0=384 1=95
MemoryData               encoders.0.encoder_pos_1 0 1 170 0=384 1=95
ExpandDims               unsqueeze_736            1 1 in0 171 -23303=1,0
Convolution              conv_188                 1 1 171 172 0=8 1=3 11=3 12=1 13=1 14=0 2=1 3=1 4=1 5=1 6=72
Split                    splitncnn_35             1 2 172 173 174
BinaryOp                 sub_0                    1 1 173 175 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_30               1 1 175 176
BinaryOp                 mul_1                    2 1 174 176 177 0=2
Convolution              conv_189                 1 1 177 178 0=32 1=3 11=3 12=1 13=2 14=0 2=1 3=2 4=0 5=1 6=2304
Split                    splitncnn_36             1 2 178 179 180
BinaryOp                 sub_2                    1 1 179 181 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_31               1 1 181 182
BinaryOp                 mul_3                    2 1 180 182 183 0=2
Convolution              conv_190                 1 1 183 184 0=128 1=3 11=3 12=1 13=1 14=0 2=1 3=2 4=0 5=1 6=36864
Split                    splitncnn_37             1 2 184 185 186
BinaryOp                 sub_4                    1 1 185 187 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_32               1 1 187 188
BinaryOp                 mul_5                    2 1 186 188 189 0=2
Crop                     crop_737                 1 1 3 190 -23310=1,1 -23311=1,0 -23309=1,0
Reshape                  encoders.0.state_select_list.0_ncnnreshape0 1 1 190 191 0=0 1=0
Crop                     crop_738                 1 1 23 192 -23310=1,1 -23311=1,0 -23309=1,0
Reshape                  pnnx_unique_15_ncnnreshape0 1 1 192 193 0=0 1=0
Crop                     crop_739                 1 1 43 194 -23310=1,1 -23311=1,0 -23309=1,0
Reshape                  pnnx_unique_16_ncnnreshape0 1 1 194 195 0=0 1=0
Crop                     crop_740                 1 1 63 196 -23310=1,1 -23311=1,0 -23309=1,0
Reshape                  pnnx_unique_17_ncnnreshape0 1 1 196 197 0=0 1=0
Crop                     crop_741                 1 1 83 198 -23310=1,1 -23311=1,0 -23309=1,0
Reshape                  pnnx_unique_18_ncnnreshape0 1 1 198 199 0=0 1=0
Crop                     crop_742                 1 1 103 200 -23310=1,1 -23311=1,0 -23309=1,0
Reshape                  pnnx_unique_19_ncnnreshape0 1 1 200 201 0=0 1=0
Crop                     crop_743                 1 1 123 202 -23310=1,1 -23311=1,0 -23309=1,0
Reshape                  pnnx_unique_20_ncnnreshape0 1 1 202 203 0=0 1=0
Permute                  permute_663              1 1 189 204 0=2
Reshape                  reshape_372              1 1 204 205 0=2432 1=-1
InnerProduct             linear_191               1 1 205 206 0=384 1=1 2=933888
Split                    splitncnn_38             1 4 206 207 208 209 210
InnerProduct             linear_192               1 1 210 211 0=1024 1=1 2=393216
Split                    splitncnn_39             1 2 211 212 213
BinaryOp                 sub_6                    1 1 212 214 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_33               1 1 214 215
BinaryOp                 mul_7                    2 1 213 215 216 0=2
InnerProduct             linear_193               1 1 216 217 0=384 1=1 2=393216
BinaryOp                 add_8                    2 1 207 217 218 0=0
Split                    splitncnn_40             1 2 218 219 220
PoolingModuleNoProj      pooling_modul_no_proj_962 3 3 220 191 193 221 222 223
InnerProduct             linear_194               1 1 221 224 0=384 1=0 2=147456
BinaryOp                 add_9                    2 1 219 224 225 0=0
Split                    splitncnn_41             1 2 225 226 227
InnerProduct             linear_195               1 1 227 228 0=512 1=1 2=196608
Slice                    tensor_split_0           1 4 228 229 230 231 232 -23300=4,192,192,96,-233 1=1
Concat                   cat_0                    2 1 197 231 233 0=0
Split                    splitncnn_42             1 2 233 234 235
Reshape                  reshape_373              1 1 234 236 0=12 1=8 2=80
Reshape                  reshape_374              1 1 229 237 0=24 1=8 2=16
Reshape                  reshape_375              1 1 232 238 0=4 1=8 2=16
Concat                   cat_1                    2 1 195 230 239 0=0
Split                    splitncnn_43             1 2 239 240 241
Reshape                  reshape_376              1 1 240 242 0=24 1=8 2=80
InnerProduct             linear_196               1 1 169 243 0=32 1=0 2=12288
Reshape                  reshape_377              1 1 243 244 0=4 1=8 2=95
Permute                  permute_846              1 1 244 245 0=3
Permute                  permute_844              1 1 238 246 0=2
MatMul                   matmul_618               2 1 246 245 247
Permute                  permute_845              1 1 242 248 0=3
Permute                  permute_843              1 1 237 249 0=2
MatMul                   matmul_619               2 1 249 248 250
TensorAsStrided          tensor_as_strided_977    1 1 247 251 -23300=3,8,16,80 -23301=3,1520,94,1 2=15
BinaryOp                 add_10                   2 1 250 251 252 0=0
Reshape                  view_573                 1 1 252 253 0=80 1=16 2=8
Softmax                  softmax_108              1 1 253 254 0=-1 1=1
Split                    splitncnn_44             1 2 254 255 256
Permute                  permute_842              1 1 236 257 0=2
MatMul                   bmm_588                  2 1 256 257 258
Permute                  permute_847              1 1 258 259 0=2
Reshape                  reshape_378              1 1 259 260 0=96 1=16
InnerProduct             linear_197               1 1 260 261 0=384 1=1 2=36864
BinaryOp                 add_11                   2 1 226 261 262 0=0
Split                    splitncnn_45             1 2 262 263 264
Permute                  permute_665              1 1 264 265 0=1
Convolution1D            conv1d_128               1 1 265 266 0=768 1=1 2=1 3=1 4=0 5=1 6=294912
GLU                      glu_0                    1 1 266 267 0=0
Concat                   cat_2                    2 1 201 267 268 0=1
Split                    splitncnn_46             1 2 268 269 270
ConvolutionDepthWise1D   convdw1d_1001            1 1 270 271 0=384 1=31 2=1 3=1 4=0 5=1 6=11904 7=384
Split                    splitncnn_47             1 2 271 272 273
BinaryOp                 sub_12                   1 1 272 274 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_34               1 1 274 275
BinaryOp                 mul_13                   2 1 273 275 276 0=2
Convolution1D            conv1d_129               1 1 276 277 0=384 1=1 2=1 3=1 4=0 5=1 6=147456
Permute                  permute_666              1 1 277 278 0=1
BinaryOp                 add_14                   2 1 263 278 279 0=0
Split                    splitncnn_48             1 2 279 280 281
InnerProduct             linear_198               1 1 281 282 0=1024 1=1 2=393216
Split                    splitncnn_49             1 2 282 283 284
BinaryOp                 sub_15                   1 1 283 285 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_35               1 1 285 286
BinaryOp                 mul_16                   2 1 284 286 287 0=2
InnerProduct             linear_199               1 1 287 288 0=384 1=1 2=393216
BinaryOp                 add_17                   2 1 280 288 289 0=0
Split                    splitncnn_50             1 2 289 290 291
InnerProduct             linear_200               1 1 291 292 0=96 1=0 2=36864
Concat                   cat_3                    2 1 199 292 293 0=0
Split                    splitncnn_51             1 2 293 294 295
Reshape                  reshape_379              1 1 294 296 0=12 1=8 2=80
Permute                  permute_848              1 1 296 297 0=2
MatMul                   bmm_589                  2 1 255 297 298
Permute                  permute_849              1 1 298 299 0=2
Reshape                  reshape_380              1 1 299 300 0=96 1=16
InnerProduct             linear_201               1 1 300 301 0=384 1=1 2=36864
BinaryOp                 add_18                   2 1 290 301 302 0=0
Split                    splitncnn_52             1 2 302 303 304
Permute                  permute_667              1 1 304 305 0=1
Convolution1D            conv1d_130               1 1 305 306 0=768 1=1 2=1 3=1 4=0 5=1 6=294912
GLU                      glu_1                    1 1 306 307 0=0
Concat                   cat_4                    2 1 203 307 308 0=1
Split                    splitncnn_53             1 2 308 309 310
ConvolutionDepthWise1D   convdw1d_1002            1 1 310 311 0=384 1=31 2=1 3=1 4=0 5=1 6=11904 7=384
Split                    splitncnn_54             1 2 311 312 313
BinaryOp                 sub_19                   1 1 312 314 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_36               1 1 314 315
BinaryOp                 mul_20                   2 1 313 315 316 0=2
Convolution1D            conv1d_131               1 1 316 317 0=384 1=1 2=1 3=1 4=0 5=1 6=147456
Permute                  permute_668              1 1 317 318 0=1
BinaryOp                 add_21                   2 1 303 318 319 0=0
Split                    splitncnn_55             1 2 319 320 321
InnerProduct             linear_202               1 1 321 322 0=1024 1=1 2=393216
Split                    splitncnn_56             1 2 322 323 324
BinaryOp                 sub_22                   1 1 323 325 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_37               1 1 325 326
BinaryOp                 mul_23                   2 1 324 326 327 0=2
InnerProduct             linear_203               1 1 327 328 0=384 1=1 2=393216
BinaryOp                 add_24                   2 1 320 328 329 0=0
Split                    splitncnn_57             1 3 329 330 331 332
BinaryOp                 mul_25                   2 1 330 331 333 0=2
Reduction                mean_648                 1 1 333 334 0=3 1=0 -23303=1,-1 4=1 5=1
BinaryOp                 add_26                   1 1 334 335 0=0 1=1 2=3.771522e+00
BinaryOp                 pow_27                   1 1 335 336 0=6 1=1 2=-5.000000e-01
BinaryOp                 mul_28                   2 1 332 336 337 0=2
BinaryOp                 sub_29                   2 1 337 208 338 0=1
BinaryOp                 mul_30                   2 1 338 168 339 0=2
BinaryOp                 add_31                   2 1 209 339 340 0=0
Split                    splitncnn_58             1 4 340 341 342 343 344
Crop                     crop_744                 1 1 2 345 -23310=1,2 -23311=1,0 -23309=1,1
Reshape                  encoders.0.state_select_list.1_ncnnreshape0 1 1 345 346 0=0 1=0
Crop                     crop_745                 1 1 22 347 -23310=1,2 -23311=1,0 -23309=1,1
Reshape                  pnnx_unique_27_ncnnreshape0 1 1 347 348 0=0 1=0
Crop                     crop_746                 1 1 42 349 -23310=1,2 -23311=1,0 -23309=1,1
Reshape                  pnnx_unique_28_ncnnreshape0 1 1 349 350 0=0 1=0
Crop                     crop_747                 1 1 62 351 -23310=1,2 -23311=1,0 -23309=1,1
Reshape                  pnnx_unique_29_ncnnreshape0 1 1 351 352 0=0 1=0
Crop                     crop_748                 1 1 82 353 -23310=1,2 -23311=1,0 -23309=1,1
Reshape                  pnnx_unique_30_ncnnreshape0 1 1 353 354 0=0 1=0
Crop                     crop_749                 1 1 102 355 -23310=1,2 -23311=1,0 -23309=1,1
Reshape                  pnnx_unique_31_ncnnreshape0 1 1 355 356 0=0 1=0
Crop                     crop_750                 1 1 122 357 -23310=1,2 -23311=1,0 -23309=1,1
Reshape                  pnnx_unique_32_ncnnreshape0 1 1 357 358 0=0 1=0
InnerProduct             linear_204               1 1 344 359 0=1024 1=1 2=393216
Split                    splitncnn_59             1 2 359 360 361
BinaryOp                 sub_32                   1 1 360 362 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_38               1 1 362 363
BinaryOp                 mul_33                   2 1 361 363 364 0=2
InnerProduct             linear_205               1 1 364 365 0=384 1=1 2=393216
BinaryOp                 add_34                   2 1 341 365 366 0=0
Split                    splitncnn_60             1 2 366 367 368
PoolingModuleNoProj      pooling_modul_no_proj_963 3 3 368 346 348 369 370 371
InnerProduct             linear_206               1 1 369 372 0=384 1=0 2=147456
BinaryOp                 add_35                   2 1 367 372 373 0=0
Split                    splitncnn_61             1 2 373 374 375
InnerProduct             linear_207               1 1 375 376 0=512 1=1 2=196608
Slice                    tensor_split_1           1 4 376 377 378 379 380 -23300=4,192,192,96,-233 1=1
Concat                   cat_5                    2 1 352 379 381 0=0
Split                    splitncnn_62             1 2 381 382 383
Reshape                  reshape_381              1 1 382 384 0=12 1=8 2=80
Reshape                  reshape_382              1 1 377 385 0=24 1=8 2=16
Reshape                  reshape_383              1 1 380 386 0=4 1=8 2=16
Concat                   cat_6                    2 1 350 378 387 0=0
Split                    splitncnn_63             1 2 387 388 389
Reshape                  reshape_384              1 1 388 390 0=24 1=8 2=80
InnerProduct             linear_208               1 1 170 391 0=32 1=0 2=12288
Reshape                  reshape_385              1 1 391 392 0=4 1=8 2=95
Permute                  permute_854              1 1 392 393 0=3
Permute                  permute_852              1 1 386 394 0=2
MatMul                   matmul_620               2 1 394 393 395
Permute                  permute_853              1 1 390 396 0=3
Permute                  permute_851              1 1 385 397 0=2
MatMul                   matmul_621               2 1 397 396 398
TensorAsStrided          tensor_as_strided_978    1 1 395 399 -23300=3,8,16,80 -23301=3,1520,94,1 2=15
BinaryOp                 add_36                   2 1 398 399 400 0=0
Reshape                  view_574                 1 1 400 401 0=80 1=16 2=8
Softmax                  softmax_109              1 1 401 402 0=-1 1=1
Split                    splitncnn_64             1 2 402 403 404
Permute                  permute_850              1 1 384 405 0=2
MatMul                   bmm_590                  2 1 404 405 406
Permute                  permute_855              1 1 406 407 0=2
Reshape                  reshape_386              1 1 407 408 0=96 1=16
InnerProduct             linear_209               1 1 408 409 0=384 1=1 2=36864
BinaryOp                 add_37                   2 1 374 409 410 0=0
Split                    splitncnn_65             1 2 410 411 412
Permute                  permute_669              1 1 412 413 0=1
Convolution1D            conv1d_132               1 1 413 414 0=768 1=1 2=1 3=1 4=0 5=1 6=294912
GLU                      glu_2                    1 1 414 415 0=0
Concat                   cat_7                    2 1 356 415 416 0=1
Split                    splitncnn_66             1 2 416 417 418
ConvolutionDepthWise1D   convdw1d_1003            1 1 418 419 0=384 1=31 2=1 3=1 4=0 5=1 6=11904 7=384
Split                    splitncnn_67             1 2 419 420 421
BinaryOp                 sub_38                   1 1 420 422 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_39               1 1 422 423
BinaryOp                 mul_39                   2 1 421 423 424 0=2
Convolution1D            conv1d_133               1 1 424 425 0=384 1=1 2=1 3=1 4=0 5=1 6=147456
Permute                  permute_670              1 1 425 426 0=1
BinaryOp                 add_40                   2 1 411 426 427 0=0
Split                    splitncnn_68             1 2 427 428 429
InnerProduct             linear_210               1 1 429 430 0=1024 1=1 2=393216
Split                    splitncnn_69             1 2 430 431 432
BinaryOp                 sub_41                   1 1 431 433 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_40               1 1 433 434
BinaryOp                 mul_42                   2 1 432 434 435 0=2
InnerProduct             linear_211               1 1 435 436 0=384 1=1 2=393216
BinaryOp                 add_43                   2 1 428 436 437 0=0
Split                    splitncnn_70             1 2 437 438 439
InnerProduct             linear_212               1 1 439 440 0=96 1=0 2=36864
Concat                   cat_8                    2 1 354 440 441 0=0
Split                    splitncnn_71             1 2 441 442 443
Reshape                  reshape_387              1 1 442 444 0=12 1=8 2=80
Permute                  permute_856              1 1 444 445 0=2
MatMul                   bmm_591                  2 1 403 445 446
Permute                  permute_857              1 1 446 447 0=2
Reshape                  reshape_388              1 1 447 448 0=96 1=16
InnerProduct             linear_213               1 1 448 449 0=384 1=1 2=36864
BinaryOp                 add_44                   2 1 438 449 450 0=0
Split                    splitncnn_72             1 2 450 451 452
Permute                  permute_671              1 1 452 453 0=1
Convolution1D            conv1d_134               1 1 453 454 0=768 1=1 2=1 3=1 4=0 5=1 6=294912
GLU                      glu_3                    1 1 454 455 0=0
Concat                   cat_9                    2 1 358 455 456 0=1
Split                    splitncnn_73             1 2 456 457 458
ConvolutionDepthWise1D   convdw1d_1004            1 1 458 459 0=384 1=31 2=1 3=1 4=0 5=1 6=11904 7=384
Split                    splitncnn_74             1 2 459 460 461
BinaryOp                 sub_45                   1 1 460 462 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_41               1 1 462 463
BinaryOp                 mul_46                   2 1 461 463 464 0=2
Convolution1D            conv1d_135               1 1 464 465 0=384 1=1 2=1 3=1 4=0 5=1 6=147456
Permute                  permute_672              1 1 465 466 0=1
BinaryOp                 add_47                   2 1 451 466 467 0=0
Split                    splitncnn_75             1 2 467 468 469
InnerProduct             linear_214               1 1 469 470 0=1024 1=1 2=393216
Split                    splitncnn_76             1 2 470 471 472
BinaryOp                 sub_48                   1 1 471 473 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_42               1 1 473 474
BinaryOp                 mul_49                   2 1 472 474 475 0=2
InnerProduct             linear_215               1 1 475 476 0=384 1=1 2=393216
BinaryOp                 add_50                   2 1 468 476 477 0=0
Split                    splitncnn_77             1 3 477 478 479 480
BinaryOp                 mul_51                   2 1 478 479 481 0=2
Reduction                mean_649                 1 1 481 482 0=3 1=0 -23303=1,-1 4=1 5=1
BinaryOp                 add_52                   1 1 482 483 0=0 1=1 2=5.114306e+00
BinaryOp                 pow_53                   1 1 483 484 0=6 1=1 2=-5.000000e-01
BinaryOp                 mul_54                   2 1 480 484 485 0=2
BinaryOp                 sub_55                   2 1 485 342 486 0=1
BinaryOp                 mul_56                   2 1 486 167 487 0=2
BinaryOp                 add_57                   2 1 343 487 488 0=0
Split                    splitncnn_78             1 2 488 489 490
MemoryData               encoders.1.downsample    0 1 491 0=384 1=1 2=1
Reshape                  reshape_389              1 1 490 492 0=384 1=2 2=8
Split                    splitncnn_79             1 2 492 493 494
BinaryOp                 mul_58                   2 1 493 491 495 0=2
Reduction                sum_726                  1 1 495 496 0=0 1=0 -23303=1,-1 4=1 5=1
Softmax                  softmax_110              1 1 496 497 0=1 1=1
BinaryOp                 mul_59                   2 1 494 497 498 0=2
Reduction                sum_727                  1 1 498 499 0=0 1=0 -23303=1,1 4=0 5=1
Crop                     crop_751                 1 1 8 500 -23310=1,1 -23311=1,0 -23309=1,0
Reshape                  encoders.1.encoder.state_select_list.0_ncnnreshape0 1 1 500 501 0=0 1=0
Crop                     crop_752                 1 1 28 502 -23310=1,1 -23311=1,0 -23309=1,0
Reshape                  pnnx_unique_40_ncnnreshape0 1 1 502 503 0=0 1=0
Crop                     crop_753                 1 1 48 504 -23310=1,1 -23311=1,0 -23309=1,0
Reshape                  pnnx_unique_41_ncnnreshape0 1 1 504 505 0=0 1=0
Crop                     crop_754                 1 1 68 506 -23310=1,1 -23311=1,0 -23309=1,0
Reshape                  pnnx_unique_42_ncnnreshape0 1 1 506 507 0=0 1=0
Crop                     crop_755                 1 1 88 508 -23310=1,1 -23311=1,0 -23309=1,0
Reshape                  pnnx_unique_43_ncnnreshape0 1 1 508 509 0=0 1=0
Crop                     crop_756                 1 1 108 510 -23310=1,1 -23311=1,0 -23309=1,0
Reshape                  pnnx_unique_44_ncnnreshape0 1 1 510 511 0=0 1=0
Crop                     crop_757                 1 1 128 512 -23310=1,1 -23311=1,0 -23309=1,0
Reshape                  pnnx_unique_45_ncnnreshape0 1 1 512 513 0=0 1=0
Split                    splitncnn_80             1 4 499 514 515 516 517
InnerProduct             linear_216               1 1 517 518 0=1024 1=1 2=393216
Split                    splitncnn_81             1 2 518 519 520
BinaryOp                 sub_60                   1 1 519 521 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_43               1 1 521 522
BinaryOp                 mul_61                   2 1 520 522 523 0=2
InnerProduct             linear_217               1 1 523 524 0=384 1=1 2=393216
BinaryOp                 add_62                   2 1 514 524 525 0=0
Split                    splitncnn_82             1 2 525 526 527
PoolingModuleNoProj      pooling_modul_no_proj_964 3 3 527 501 503 528 529 530
InnerProduct             linear_218               1 1 528 531 0=384 1=0 2=147456
BinaryOp                 add_63                   2 1 526 531 532 0=0
Split                    splitncnn_83             1 2 532 533 534
InnerProduct             linear_219               1 1 534 535 0=512 1=1 2=196608
Slice                    tensor_split_2           1 4 535 536 537 538 539 -23300=4,192,192,96,-233 1=1
Concat                   cat_10                   2 1 507 538 540 0=0
Split                    splitncnn_84             1 2 540 541 542
Reshape                  reshape_390              1 1 541 543 0=12 1=8 2=40
Reshape                  reshape_391              1 1 536 544 0=24 1=8 2=8
Reshape                  reshape_392              1 1 539 545 0=4 1=8 2=8
Concat                   cat_11                   2 1 505 537 546 0=0
Split                    splitncnn_85             1 2 546 547 548
Reshape                  reshape_393              1 1 547 549 0=24 1=8 2=40
InnerProduct             linear_220               1 1 163 550 0=32 1=0 2=12288
Reshape                  reshape_394              1 1 550 551 0=4 1=8 2=47
Permute                  permute_862              1 1 551 552 0=3
Permute                  permute_860              1 1 545 553 0=2
MatMul                   matmul_622               2 1 553 552 554
Permute                  permute_861              1 1 549 555 0=3
Permute                  permute_859              1 1 544 556 0=2
MatMul                   matmul_623               2 1 556 555 557
TensorAsStrided          tensor_as_strided_979    1 1 554 558 -23300=3,8,8,40 -23301=3,376,46,1 2=7
BinaryOp                 add_64                   2 1 557 558 559 0=0
Reshape                  view_575                 1 1 559 560 0=40 1=8 2=8
Softmax                  softmax_111              1 1 560 561 0=-1 1=1
Split                    splitncnn_86             1 2 561 562 563
Permute                  permute_858              1 1 543 564 0=2
MatMul                   bmm_592                  2 1 563 564 565
Permute                  permute_863              1 1 565 566 0=2
Reshape                  reshape_395              1 1 566 567 0=96 1=8
InnerProduct             linear_221               1 1 567 568 0=384 1=1 2=36864
BinaryOp                 add_65                   2 1 533 568 569 0=0
Split                    splitncnn_87             1 2 569 570 571
Permute                  permute_673              1 1 571 572 0=1
Convolution1D            conv1d_136               1 1 572 573 0=768 1=1 2=1 3=1 4=0 5=1 6=294912
GLU                      glu_4                    1 1 573 574 0=0
Concat                   cat_12                   2 1 511 574 575 0=1
Split                    splitncnn_88             1 2 575 576 577
ConvolutionDepthWise1D   convdw1d_1005            1 1 577 578 0=384 1=31 2=1 3=1 4=0 5=1 6=11904 7=384
Split                    splitncnn_89             1 2 578 579 580
BinaryOp                 sub_66                   1 1 579 581 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_44               1 1 581 582
BinaryOp                 mul_67                   2 1 580 582 583 0=2
Convolution1D            conv1d_137               1 1 583 584 0=384 1=1 2=1 3=1 4=0 5=1 6=147456
Permute                  permute_674              1 1 584 585 0=1
BinaryOp                 add_68                   2 1 570 585 586 0=0
Split                    splitncnn_90             1 2 586 587 588
InnerProduct             linear_222               1 1 588 589 0=1024 1=1 2=393216
Split                    splitncnn_91             1 2 589 590 591
BinaryOp                 sub_69                   1 1 590 592 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_45               1 1 592 593
BinaryOp                 mul_70                   2 1 591 593 594 0=2
InnerProduct             linear_223               1 1 594 595 0=384 1=1 2=393216
BinaryOp                 add_71                   2 1 587 595 596 0=0
Split                    splitncnn_92             1 2 596 597 598
InnerProduct             linear_224               1 1 598 599 0=96 1=0 2=36864
Concat                   cat_13                   2 1 509 599 600 0=0
Split                    splitncnn_93             1 2 600 601 602
Reshape                  reshape_396              1 1 601 603 0=12 1=8 2=40
Permute                  permute_864              1 1 603 604 0=2
MatMul                   bmm_593                  2 1 562 604 605
Permute                  permute_865              1 1 605 606 0=2
Reshape                  reshape_397              1 1 606 607 0=96 1=8
InnerProduct             linear_225               1 1 607 608 0=384 1=1 2=36864
BinaryOp                 add_72                   2 1 597 608 609 0=0
Split                    splitncnn_94             1 2 609 610 611
Permute                  permute_675              1 1 611 612 0=1
Convolution1D            conv1d_138               1 1 612 613 0=768 1=1 2=1 3=1 4=0 5=1 6=294912
GLU                      glu_5                    1 1 613 614 0=0
Concat                   cat_14                   2 1 513 614 615 0=1
Split                    splitncnn_95             1 2 615 616 617
ConvolutionDepthWise1D   convdw1d_1006            1 1 617 618 0=384 1=31 2=1 3=1 4=0 5=1 6=11904 7=384
Split                    splitncnn_96             1 2 618 619 620
BinaryOp                 sub_73                   1 1 619 621 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_46               1 1 621 622
BinaryOp                 mul_74                   2 1 620 622 623 0=2
Convolution1D            conv1d_139               1 1 623 624 0=384 1=1 2=1 3=1 4=0 5=1 6=147456
Permute                  permute_676              1 1 624 625 0=1
BinaryOp                 add_75                   2 1 610 625 626 0=0
Split                    splitncnn_97             1 2 626 627 628
InnerProduct             linear_226               1 1 628 629 0=1024 1=1 2=393216
Split                    splitncnn_98             1 2 629 630 631
BinaryOp                 sub_76                   1 1 630 632 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_47               1 1 632 633
BinaryOp                 mul_77                   2 1 631 633 634 0=2
InnerProduct             linear_227               1 1 634 635 0=384 1=1 2=393216
BinaryOp                 add_78                   2 1 627 635 636 0=0
Split                    splitncnn_99             1 3 636 637 638 639
BinaryOp                 mul_79                   2 1 637 638 640 0=2
Reduction                mean_650                 1 1 640 641 0=3 1=0 -23303=1,-1 4=1 5=1
BinaryOp                 add_80                   1 1 641 642 0=0 1=1 2=2.581174e+00
BinaryOp                 pow_81                   1 1 642 643 0=6 1=1 2=-5.000000e-01
BinaryOp                 mul_82                   2 1 639 643 644 0=2
BinaryOp                 sub_83                   2 1 644 515 645 0=1
BinaryOp                 mul_84                   2 1 645 162 646 0=2
BinaryOp                 add_85                   2 1 516 646 647 0=0
Split                    splitncnn_100            1 4 647 648 649 650 651
Crop                     crop_758                 1 1 7 652 -23310=1,2 -23311=1,0 -23309=1,1
Reshape                  encoders.1.encoder.state_select_list.1_ncnnreshape0 1 1 652 653 0=0 1=0
Crop                     crop_759                 1 1 27 654 -23310=1,2 -23311=1,0 -23309=1,1
Reshape                  pnnx_unique_53_ncnnreshape0 1 1 654 655 0=0 1=0
Crop                     crop_760                 1 1 47 656 -23310=1,2 -23311=1,0 -23309=1,1
Reshape                  pnnx_unique_54_ncnnreshape0 1 1 656 657 0=0 1=0
Crop                     crop_761                 1 1 67 658 -23310=1,2 -23311=1,0 -23309=1,1
Reshape                  pnnx_unique_55_ncnnreshape0 1 1 658 659 0=0 1=0
Crop                     crop_762                 1 1 87 660 -23310=1,2 -23311=1,0 -23309=1,1
Reshape                  pnnx_unique_56_ncnnreshape0 1 1 660 661 0=0 1=0
Crop                     crop_763                 1 1 107 662 -23310=1,2 -23311=1,0 -23309=1,1
Reshape                  pnnx_unique_57_ncnnreshape0 1 1 662 663 0=0 1=0
Crop                     crop_764                 1 1 127 664 -23310=1,2 -23311=1,0 -23309=1,1
Reshape                  pnnx_unique_58_ncnnreshape0 1 1 664 665 0=0 1=0
InnerProduct             linear_228               1 1 651 666 0=1024 1=1 2=393216
Split                    splitncnn_101            1 2 666 667 668
BinaryOp                 sub_86                   1 1 667 669 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_48               1 1 669 670
BinaryOp                 mul_87                   2 1 668 670 671 0=2
InnerProduct             linear_229               1 1 671 672 0=384 1=1 2=393216
BinaryOp                 add_88                   2 1 648 672 673 0=0
Split                    splitncnn_102            1 2 673 674 675
PoolingModuleNoProj      pooling_modul_no_proj_965 3 3 675 653 655 676 677 678
InnerProduct             linear_230               1 1 676 679 0=384 1=0 2=147456
BinaryOp                 add_89                   2 1 674 679 680 0=0
Split                    splitncnn_103            1 2 680 681 682
InnerProduct             linear_231               1 1 682 683 0=512 1=1 2=196608
Slice                    tensor_split_3           1 4 683 684 685 686 687 -23300=4,192,192,96,-233 1=1
Concat                   cat_15                   2 1 659 686 688 0=0
Split                    splitncnn_104            1 2 688 689 690
Reshape                  reshape_398              1 1 689 691 0=12 1=8 2=40
Reshape                  reshape_399              1 1 684 692 0=24 1=8 2=8
Reshape                  reshape_400              1 1 687 693 0=4 1=8 2=8
Concat                   cat_16                   2 1 657 685 694 0=0
Split                    splitncnn_105            1 2 694 695 696
Reshape                  reshape_401              1 1 695 697 0=24 1=8 2=40
InnerProduct             linear_232               1 1 166 698 0=32 1=0 2=12288
Reshape                  reshape_402              1 1 698 699 0=4 1=8 2=47
Permute                  permute_870              1 1 699 700 0=3
Permute                  permute_868              1 1 693 701 0=2
MatMul                   matmul_624               2 1 701 700 702
Permute                  permute_869              1 1 697 703 0=3
Permute                  permute_867              1 1 692 704 0=2
MatMul                   matmul_625               2 1 704 703 705
TensorAsStrided          tensor_as_strided_980    1 1 702 706 -23300=3,8,8,40 -23301=3,376,46,1 2=7
BinaryOp                 add_90                   2 1 705 706 707 0=0
Reshape                  view_576                 1 1 707 708 0=40 1=8 2=8
Softmax                  softmax_112              1 1 708 709 0=-1 1=1
Split                    splitncnn_106            1 2 709 710 711
Permute                  permute_866              1 1 691 712 0=2
MatMul                   bmm_594                  2 1 711 712 713
Permute                  permute_871              1 1 713 714 0=2
Reshape                  reshape_403              1 1 714 715 0=96 1=8
InnerProduct             linear_233               1 1 715 716 0=384 1=1 2=36864
BinaryOp                 add_91                   2 1 681 716 717 0=0
Split                    splitncnn_107            1 2 717 718 719
Permute                  permute_677              1 1 719 720 0=1
Convolution1D            conv1d_140               1 1 720 721 0=768 1=1 2=1 3=1 4=0 5=1 6=294912
GLU                      glu_6                    1 1 721 722 0=0
Concat                   cat_17                   2 1 663 722 723 0=1
Split                    splitncnn_108            1 2 723 724 725
ConvolutionDepthWise1D   convdw1d_1007            1 1 725 726 0=384 1=31 2=1 3=1 4=0 5=1 6=11904 7=384
Split                    splitncnn_109            1 2 726 727 728
BinaryOp                 sub_92                   1 1 727 729 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_49               1 1 729 730
BinaryOp                 mul_93                   2 1 728 730 731 0=2
Convolution1D            conv1d_141               1 1 731 732 0=384 1=1 2=1 3=1 4=0 5=1 6=147456
Permute                  permute_678              1 1 732 733 0=1
BinaryOp                 add_94                   2 1 718 733 734 0=0
Split                    splitncnn_110            1 2 734 735 736
InnerProduct             linear_234               1 1 736 737 0=1024 1=1 2=393216
Split                    splitncnn_111            1 2 737 738 739
BinaryOp                 sub_95                   1 1 738 740 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_50               1 1 740 741
BinaryOp                 mul_96                   2 1 739 741 742 0=2
InnerProduct             linear_235               1 1 742 743 0=384 1=1 2=393216
BinaryOp                 add_97                   2 1 735 743 744 0=0
Split                    splitncnn_112            1 2 744 745 746
InnerProduct             linear_236               1 1 746 747 0=96 1=0 2=36864
Concat                   cat_18                   2 1 661 747 748 0=0
Split                    splitncnn_113            1 2 748 749 750
Reshape                  reshape_404              1 1 749 751 0=12 1=8 2=40
Permute                  permute_872              1 1 751 752 0=2
MatMul                   bmm_595                  2 1 710 752 753
Permute                  permute_873              1 1 753 754 0=2
Reshape                  reshape_405              1 1 754 755 0=96 1=8
InnerProduct             linear_237               1 1 755 756 0=384 1=1 2=36864
BinaryOp                 add_98                   2 1 745 756 757 0=0
Split                    splitncnn_114            1 2 757 758 759
Permute                  permute_679              1 1 759 760 0=1
Convolution1D            conv1d_142               1 1 760 761 0=768 1=1 2=1 3=1 4=0 5=1 6=294912
GLU                      glu_7                    1 1 761 762 0=0
Concat                   cat_19                   2 1 665 762 763 0=1
Split                    splitncnn_115            1 2 763 764 765
ConvolutionDepthWise1D   convdw1d_1008            1 1 765 766 0=384 1=31 2=1 3=1 4=0 5=1 6=11904 7=384
Split                    splitncnn_116            1 2 766 767 768
BinaryOp                 sub_99                   1 1 767 769 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_51               1 1 769 770
BinaryOp                 mul_100                  2 1 768 770 771 0=2
Convolution1D            conv1d_143               1 1 771 772 0=384 1=1 2=1 3=1 4=0 5=1 6=147456
Permute                  permute_680              1 1 772 773 0=1
BinaryOp                 add_101                  2 1 758 773 774 0=0
Split                    splitncnn_117            1 2 774 775 776
InnerProduct             linear_238               1 1 776 777 0=1024 1=1 2=393216
Split                    splitncnn_118            1 2 777 778 779
BinaryOp                 sub_102                  1 1 778 780 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_52               1 1 780 781
BinaryOp                 mul_103                  2 1 779 781 782 0=2
InnerProduct             linear_239               1 1 782 783 0=384 1=1 2=393216
BinaryOp                 add_104                  2 1 775 783 784 0=0
Split                    splitncnn_119            1 3 784 785 786 787
BinaryOp                 mul_105                  2 1 785 786 788 0=2
Reduction                mean_651                 1 1 788 789 0=3 1=0 -23303=1,-1 4=1 5=1
BinaryOp                 add_106                  1 1 789 790 0=0 1=1 2=3.062476e+00
BinaryOp                 pow_107                  1 1 790 791 0=6 1=1 2=-5.000000e-01
BinaryOp                 mul_108                  2 1 787 791 792 0=2
BinaryOp                 sub_109                  2 1 792 649 793 0=1
BinaryOp                 mul_110                  2 1 793 161 794 0=2
BinaryOp                 add_111                  2 1 650 794 795 0=0
Split                    splitncnn_120            1 4 795 796 797 798 799
Crop                     crop_765                 1 1 6 800 -23310=1,3 -23311=1,0 -23309=1,2
Reshape                  encoders.1.encoder.state_select_list.2_ncnnreshape0 1 1 800 801 0=0 1=0
Crop                     crop_766                 1 1 26 802 -23310=1,3 -23311=1,0 -23309=1,2
Reshape                  pnnx_unique_66_ncnnreshape0 1 1 802 803 0=0 1=0
Crop                     crop_767                 1 1 46 804 -23310=1,3 -23311=1,0 -23309=1,2
Reshape                  pnnx_unique_67_ncnnreshape0 1 1 804 805 0=0 1=0
Crop                     crop_768                 1 1 66 806 -23310=1,3 -23311=1,0 -23309=1,2
Reshape                  pnnx_unique_68_ncnnreshape0 1 1 806 807 0=0 1=0
Crop                     crop_769                 1 1 86 808 -23310=1,3 -23311=1,0 -23309=1,2
Reshape                  pnnx_unique_69_ncnnreshape0 1 1 808 809 0=0 1=0
Crop                     crop_770                 1 1 106 810 -23310=1,3 -23311=1,0 -23309=1,2
Reshape                  pnnx_unique_70_ncnnreshape0 1 1 810 811 0=0 1=0
Crop                     crop_771                 1 1 126 812 -23310=1,3 -23311=1,0 -23309=1,2
Reshape                  pnnx_unique_71_ncnnreshape0 1 1 812 813 0=0 1=0
InnerProduct             linear_240               1 1 799 814 0=1024 1=1 2=393216
Split                    splitncnn_121            1 2 814 815 816
BinaryOp                 sub_112                  1 1 815 817 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_53               1 1 817 818
BinaryOp                 mul_113                  2 1 816 818 819 0=2
InnerProduct             linear_241               1 1 819 820 0=384 1=1 2=393216
BinaryOp                 add_114                  2 1 796 820 821 0=0
Split                    splitncnn_122            1 2 821 822 823
PoolingModuleNoProj      pooling_modul_no_proj_966 3 3 823 801 803 824 825 826
InnerProduct             linear_242               1 1 824 827 0=384 1=0 2=147456
BinaryOp                 add_115                  2 1 822 827 828 0=0
Split                    splitncnn_123            1 2 828 829 830
InnerProduct             linear_243               1 1 830 831 0=512 1=1 2=196608
Slice                    tensor_split_4           1 4 831 832 833 834 835 -23300=4,192,192,96,-233 1=1
Concat                   cat_20                   2 1 807 834 836 0=0
Split                    splitncnn_124            1 2 836 837 838
Reshape                  reshape_406              1 1 837 839 0=12 1=8 2=40
Reshape                  reshape_407              1 1 832 840 0=24 1=8 2=8
Reshape                  reshape_408              1 1 835 841 0=4 1=8 2=8
Concat                   cat_21                   2 1 805 833 842 0=0
Split                    splitncnn_125            1 2 842 843 844
Reshape                  reshape_409              1 1 843 845 0=24 1=8 2=40
InnerProduct             linear_244               1 1 165 846 0=32 1=0 2=12288
Reshape                  reshape_410              1 1 846 847 0=4 1=8 2=47
Permute                  permute_878              1 1 847 848 0=3
Permute                  permute_876              1 1 841 849 0=2
MatMul                   matmul_626               2 1 849 848 850
Permute                  permute_877              1 1 845 851 0=3
Permute                  permute_875              1 1 840 852 0=2
MatMul                   matmul_627               2 1 852 851 853
TensorAsStrided          tensor_as_strided_981    1 1 850 854 -23300=3,8,8,40 -23301=3,376,46,1 2=7
BinaryOp                 add_116                  2 1 853 854 855 0=0
Reshape                  view_577                 1 1 855 856 0=40 1=8 2=8
Softmax                  softmax_113              1 1 856 857 0=-1 1=1
Split                    splitncnn_126            1 2 857 858 859
Permute                  permute_874              1 1 839 860 0=2
MatMul                   bmm_596                  2 1 859 860 861
Permute                  permute_879              1 1 861 862 0=2
Reshape                  reshape_411              1 1 862 863 0=96 1=8
InnerProduct             linear_245               1 1 863 864 0=384 1=1 2=36864
BinaryOp                 add_117                  2 1 829 864 865 0=0
Split                    splitncnn_127            1 2 865 866 867
Permute                  permute_681              1 1 867 868 0=1
Convolution1D            conv1d_144               1 1 868 869 0=768 1=1 2=1 3=1 4=0 5=1 6=294912
GLU                      glu_8                    1 1 869 870 0=0
Concat                   cat_22                   2 1 811 870 871 0=1
Split                    splitncnn_128            1 2 871 872 873
ConvolutionDepthWise1D   convdw1d_1009            1 1 873 874 0=384 1=31 2=1 3=1 4=0 5=1 6=11904 7=384
Split                    splitncnn_129            1 2 874 875 876
BinaryOp                 sub_118                  1 1 875 877 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_54               1 1 877 878
BinaryOp                 mul_119                  2 1 876 878 879 0=2
